app/views/groups/index.html.erb

SELECT `memberships`.* FROM `memberships` WHERE `memberships`.`group_id` = 1
---
        <td><%= group.name %></td>
        <td><% group.memberships.each do |membership| %>