app/views/posts/edit.html.erb

<table class="table table-bordered">
	<%@comments = @post.comments.order('created_at ASC')%>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 4  ORDER BY created_at ASC