app/controllers/assignments_controller.rb

SELECT `assignments`.* FROM `assignments`
---
  def index
    @assignments = Assignment.all

SELECT  `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`assignment_id` = 1  ORDER BY user_name desc
SELECT `posts`.* FROM `posts` WHERE `posts`.`assignment_id` = 2  ORDER BY number_of_comments desc
SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.`id` = `memberships`.`group_id` WHERE `memberships`.`user_id` = 3
SELECT `users`.* FROM `users` INNER JOIN `memberships` ON `users`.`id` = `memberships`.`user_id` WHERE `memberships`.`group_id` = 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2
---
  def postlist
    @assignment = Assignment.find(params[:id])


    if current_user.admin?
      if sort_column.nil?
        @posts = Post.where(assignment_id: @assignment.id).order("user_name" + " " + "asc")
      else
        @posts = Post.where(assignment_id: @assignment.id).order(sort_column + " " + sort_direction)
      end
    else
    @groups = current_user.groups
    @users = Array.new
      @groups.each do |group|
          group.users.each do |u|
            @users << u
          end
      end
    @posts = Array.new
      @users.each do |u|
        u.posts.each do |p|

INSERT INTO `assignments` (`title`, `description`, `draft_due`, `final_due`, `created_at`, `updated_at`) VALUES ('sfas', '<p>cSDc</p>\r\n', '2015-09-22 14:47:00', '2015-09-22 14:47:00', '2015-09-22 14:47:47', '2015-09-22 14:47:47')
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

UPDATE `assignments` SET `description` = '<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nunc sit amet laoreet leo, at malesuada nunc. Aenean sit amet velit ipsum. Nunc blandit velit sed libero ultricies commodo. Cras mollis leo diam, vitae tristique ex lobortis et. Praesent gravida dolor ac semper lobortis. Vestibulum scelerisque tincidunt dignissim. Maecenas rutrum a dolor sit amet volutpat. Cras at gravida lorem.</p>\r\n\r\n<p>Vivamus id mi bibendum, convallis est ac, aliquam magna. Mauris et feugiat libero. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse semper tristique nisl, vitae aliquam ex varius non. Nulla eget viverra quam. Ut nec hendrerit velit. Morbi fermentum dolor eu nisl iaculis, sit amet dapibus est tincidunt. Nam eu imperdiet urna. Cras felis odio, sodales ut felis sed, pretium tempus neque. Mauris mollis augue urna, sed aliquet nisl molestie id.</p>\r\n', `updated_at` = '2016-01-19 21:06:24' WHERE `assignments`.`id` = 1
---
  def update
    respond_to do |format|
      if @assignment.update(assignment_params)

SELECT  `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1
---
    def set_assignment
      @assignment = Assignment.find(params[:id])