app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT `groups`.* FROM `groups`

  def new
    @group = Group.new
    @users = User.where(admin: false)
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = 0

  def edit
    @users = User.where(admin: false)
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = 0

  def create
    @group = Group.new(params[:group].permit(:name, memberships_attributes:[:id, :user_id, :group_id, :_destroy]))

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('', '2016-01-19 20:19:06', '2016-01-19 20:19:06')
INSERT INTO `memberships` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (4, 1, '2016-01-19 20:19:06', '2016-01-19 20:19:06')

  def update
    respond_to do |format|
      if @group.update(params[:group].permit(:name, memberships_attributes:[:id, :user_id, :group_id, :_destroy]))
---
UPDATE `groups` SET `name` = 'Group 3', `updated_at` = '2016-01-19 21:05:24' WHERE `groups`.`id` = 5
UPDATE `memberships` SET `user_id` = 5, `updated_at` = '2016-01-19 20:30:03' WHERE `memberships`.`id` = 10

  def destroy
    @group.destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 2

    def set_group
      @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1