app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = Post.where(user_id: @user.id).order(assignment_id: :asc)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3  ORDER BY `posts`.`assignment_id` ASC

  def userlist
    @users = User.where(admin: false).order(name: :asc)
---
SELECT `users`.* FROM `users` WHERE `users`.`admin` = 0  ORDER BY `users`.`name` ASC

  def new
    @assignment = Assignment.find(params[:assignment_id])
---
SELECT  `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 2 LIMIT 1

  def edit
    @user = current_user
    @assignment = Assignment.find(params[:assignment_id])
---
SELECT  `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1

  def create
    @post = Post.new(post_params)
    @user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `content`, `user_id`, `assignment_id`, `user_name`, `created_at`, `updated_at`) VALUES ('Sally 1', '<p>Sally 1</p>\r\n', 4, 2, 'Sally Sue', '2015-09-22 19:24:24', '2015-09-22 19:24:24')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `content` = '<p>The Tribe</p>\r\n', `user_name` = 'Mike Hargrove', `updated_at` = '2016-01-19 21:55:42' WHERE `posts`.`id` = 4

    def set_post
      @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1